# -*- eval: (progn (auto-revert-mode 1)); -*-
**** 01
#+begin_src eshell :dir /home/buyn/Dev/ClojureScript/tutorials/learn-reagent-course-files/increments/
diff -r 16-update-gig 17-refactor-gigs
#+end_src

#+RESULTS:
#+begin_example
diff -r 16-update-gig/src/giggin/components/gig_editor.cljs 17-refactor-gigs/src/giggin/components/gig_editor.cljs
13,14c13,14
<   [modal values insert-gig]
<   [:div.modal (when @modal {:class "active"})
---
>   [modal values upsert-gig toggle-modal]
>   [:div.modal (when (:active @modal) {:class "active"})
43c43
<       {:on-click #(reset! modal false)}
---
>       {:on-click #(toggle-modal {:active false :gig {}})}
46c46
<       {:on-click #(insert-gig @values)}
---
>       {:on-click #(upsert-gig @values)}
diff -r 16-update-gig/src/giggin/components/gigs.cljs 17-refactor-gigs/src/giggin/components/gigs.cljs
10,11c10,11
<   (let [modal (r/atom false)
<         values (r/atom {:id (str "gig-" (random-uuid)) :title "" :desc "" :price 0 :img "" :sold-out false})
---
>   (let [modal (r/atom {:active false})
>         values (r/atom {:id nil :title "" :desc "" :price 0 :img "" :sold-out false})
13,14c13,18
<         insert-gig (fn [{:keys [id title desc price img sold-out]}]
<                      (swap! state/gigs assoc id {:id id
---
>         toggle-modal (fn
>                        [{:keys [active gig]}]
>                        (swap! modal assoc :active active)
>                        (reset! values gig))
>         upsert-gig (fn [{:keys [id title desc price img sold-out]}]
>                      (swap! state/gigs assoc id {:id (or id (str "gig-" (random-uuid)))
20c24
<                      (reset! modal false))]
---
>                      (toggle-modal {:active false :gig {}}))]
26c30
<          {:on-click #(reset! modal true)}
---
>          {:on-click #(toggle-modal {:active true :gig {}})}
30,31c34,35
<         [gig-editor modal values insert-gig]
<         (for [{:keys [id img title price desc]} (vals @state/gigs)]
---
>         [gig-editor modal values upsert-gig toggle-modal]
>         (for [{:keys [id img title price desc] :as gig} (vals @state/gigs)]
33c37,40
<            [:img.gig__artwork {:src img :alt title}]
---
>            [:img.gig__artwork.gig__edit {:src img
>                                          :alt title
>                                          :on-click #(toggle-modal {:active true
>                                                                    :gig gig})}]
#+end_example


**** 02
#+begin_src eshell
cd /home/buyn/Dev/ClojureScript/tutorials/learn-reagent-course-files/increments/
diff -r 16-update-gig 17-refactor-gigs
#+end_src

#+RESULTS:
#+begin_example
diff -r 16-update-gig/src/giggin/components/gig_editor.cljs 17-refactor-gigs/src/giggin/components/gig_editor.cljs
13,14c13,14
<   [modal values insert-gig]
<   [:div.modal (when @modal {:class "active"})
---
>   [modal values upsert-gig toggle-modal]
>   [:div.modal (when (:active @modal) {:class "active"})
43c43
<       {:on-click #(reset! modal false)}
---
>       {:on-click #(toggle-modal {:active false :gig {}})}
46c46
<       {:on-click #(insert-gig @values)}
---
>       {:on-click #(upsert-gig @values)}
diff -r 16-update-gig/src/giggin/components/gigs.cljs 17-refactor-gigs/src/giggin/components/gigs.cljs
10,11c10,11
<   (let [modal (r/atom false)
<         values (r/atom {:id (str "gig-" (random-uuid)) :title "" :desc "" :price 0 :img "" :sold-out false})
---
>   (let [modal (r/atom {:active false})
>         values (r/atom {:id nil :title "" :desc "" :price 0 :img "" :sold-out false})
13,14c13,18
<         insert-gig (fn [{:keys [id title desc price img sold-out]}]
<                      (swap! state/gigs assoc id {:id id
---
>         toggle-modal (fn
>                        [{:keys [active gig]}]
>                        (swap! modal assoc :active active)
>                        (reset! values gig))
>         upsert-gig (fn [{:keys [id title desc price img sold-out]}]
>                      (swap! state/gigs assoc id {:id (or id (str "gig-" (random-uuid)))
20c24
<                      (reset! modal false))]
---
>                      (toggle-modal {:active false :gig {}}))]
26c30
<          {:on-click #(reset! modal true)}
---
>          {:on-click #(toggle-modal {:active true :gig {}})}
30,31c34,35
<         [gig-editor modal values insert-gig]
<         (for [{:keys [id img title price desc]} (vals @state/gigs)]
---
>         [gig-editor modal values upsert-gig toggle-modal]
>         (for [{:keys [id img title price desc] :as gig} (vals @state/gigs)]
33c37,40
<            [:img.gig__artwork {:src img :alt title}]
---
>            [:img.gig__artwork.gig__edit {:src img
>                                          :alt title
>                                          :on-click #(toggle-modal {:active true
>                                                                    :gig gig})}]
#+end_example
**** dropbox in org
#+begin_src sh  
grep --include=\*.cljs -rnw ./ -e ":todos-by-status"
#+end_src       

#+RESULTS:
| ./src/keechma_todomvc/components/todo_list.cljs:18:-                     | `:todos-by-status` | returns           | `todos`         | with  | a   | `status`         |                    |
| ./src/keechma_todomvc/components/todo_list.cljs:26:                      | (doall             | (map              | todo-item       | (sub> | ctx | :todos-by-status | route-status)))])) |
| ./src/keechma_todomvc/components/todo_list.cljs:31:                      | :subscription-deps | [:todos-by-status |                 |       |     |                  |                    |
| ./src/keechma_todomvc/subscriptions.cljs:48:(def                         | subscriptions      | {:todos-by-status | todos-by-status |       |     |                  |                    |
| ./resources/public/js/dev/keechma_todomvc/components/todo_list.cljs:18:- | `:todos-by-status` | returns           | `todos`         | with  | a   | `status`         |                    |
| ./resources/public/js/dev/keechma_todomvc/components/todo_list.cljs:26:  | (doall             | (map              | todo-item       | (sub> | ctx | :todos-by-status | route-status)))])) |
| ./resources/public/js/dev/keechma_todomvc/components/todo_list.cljs:31:  | :subscription-deps | [:todos-by-status |                 |       |     |                  |                    |
| ./resources/public/js/dev/keechma_todomvc/subscriptions.cljs:48:(def     | subscriptions      | {:todos-by-status | todos-by-status |       |     |                  |                    |


**** dropbox in org
#+begin_src sh  
grep --include=\*.cljs -rnw ./ -e "reagent.core"
#+end_src       

#+RESULTS:
| ./src/keechma_todomvc/components/new_todo.cljs:5:                          | [reagent.core    | :as             | reagent])) |         |        |           |
| ./target/public/cljs-out/dev/reagent/core.cljs:1:(ns                       | reagent.core     |                 |            |         |        |           |
| ./target/public/cljs-out/dev/reagent/core.cljs:2:                          | (:require-macros | [reagent.core]) |            |         |        |           |
| ./target/public/cljs-out/dev/keechma_todomvc/components/new_todo.cljs:5:   | [reagent.core    | :as             | reagent])) |         |        |           |
| ./target/public/cljs-out/dev/keechma_todomvc/components/todo_edit.cljs:5:  | [reagent.core    | :as             | reagent])) |         |        |           |
| ./target/public/cljs-out/dev/keechma/app_state/react_native_router.cljs:3: | [reagent.core    | :as             | r]         |         |        |           |
| ./target/public/cljs-out/dev/keechma/app_state.cljs:2:                     | (:require        | [reagent.core   | :as        | reagent | :refer | [cursor]] |

*** I
#+begin_src eshell :tangle no :dir /home/buyn/Dev/ClojureScript/grom.org
tree -I "node_modules|.venv|__pycache__|public/js"

 #+end_src

 #+RESULTS:
 #+begin_example
 .
 ├── grom.org
 ├── package.json
 ├── package-lock.json
 ├── public
 │   ├── css
 │   │   └── style.css
 │   └── index.html
 ├── README.md
 ├── README.md~1
 ├── resources
 │   └── public
 ├── shadow-cljs.edn
 └── src
     └── ueava
         └── core.cljs

 7 directories, 9 files
 #+end_example

** from en
#+begin_src translate :dest ru
: hallucinations
#+end_src

#+RESULTS:
: : галлюцинации
*** (* (/ : 
#+BEGIN_SRC elisp
(* 
	(/ 0.02 100)
	1000000
	)
#+END_SRC

#+RESULTS:
: 200.0

#+BEGIN_SRC elisp
(/ 
	5000
	220
	)
#+END_SRC

#+RESULTS:
: 22


#+BEGIN_SRC elisp
(+ 
	(* 200 36)
	(* 1000 25)
	(* 2000 15)
	(* 5000 8)
	(* 20000 5)
	)
#+END_SRC

		#+RESULTS:
		: 202200
		

#+BEGIN_SRC calc :var a=2 b=9 c=64 x=5
((a+b)^3 + sqrt(c)) / (2x+1)
#+END_SRC

#+begin_src emacs-lisp :tangle yes
(setq сутки10 100)
(setq час10 100)
(setq минут10 100)
(setq сутки12 24)
(setq час12 60)
(setq минут12 60)
#+end_src

#+RESULTS:
: 60

#+begin_src emacs-lisp :tangle yes
(setq cof24 (/ сутки10 сутки12))
#+end_src

#+RESULTS:
: 4

#+begin_src emacs-lisp :tangle yes
(setq cof10 (/  сутки12 сутки10))
#+end_src

#+RESULTS:
: 0

#+begin_src emacs-lisp :tangle yes
(* сутки10 cof10)
#+end_src

#+RESULTS:
: 0
*** (/ : 
#+BEGIN_SRC elisp
	(- (/ 40000 12) (/ 30000 12))
#+END_SRC

#+RESULTS:
: 833
*** $
#+BEGIN_SRC elisp
(* 
	(/
	 30000
	 12)
	30
	)
#+END_SRC

#+RESULTS:
: 75000
*** var
#+NAME: sumR
#+HEADER: :var a=42 d=57 :var f=23
#+HEADERS: :var b=79 e=79
#+BEGIN_SRC elisp
(+ a d)
#+END_SRC

#+RESULTS: sumR
: 99


#+HEADERS: :var b=sumR
#+BEGIN_SRC elisp
b
#+END_SRC

#+RESULTS:
: 99

#+NAME: cool-numbers
|  1 | 1 |   1 | 14 |    1 |  74 |
|  2 | 7 |   4 | 25 |    8 | 823 |
|  3 | 2 |   9 | 68 |   27 | 402 |
|  4 | 4 |  16 | 17 |   64 | 229 |
|  5 | 6 |  25 |  4 |  125 | 208 |
|  6 | 7 |  36 | 67 |  216 | 203 |
|  7 | 0 |  49 | 96 |  343 | 445 |
|  8 | 0 |  64 | 58 |  512 | 908 |
|  9 | 2 |  81 | 15 |  729 | 465 |
| 10 | 0 | 100 | 61 | 1000 | 798 |


#+HEADERS: :var line=cool-numbers[4]
#+BEGIN_SRC elisp
(print line)
#+END_SRC

#+RESULTS:
| 5 | 6 | 25 | 4 | 125 | 208 |


